type ITeacher = "Прохорчук Анна Владимировна" | "Мороз Лариса Михайловна" | "Ханько Андрей Викторович" | "Янович Надежда Ивановна" | "Марков Владислав Игоревич" | "Кривицкий Сергей Валентинович" | "Праволоцкий Алексей Николаевич" | "Ерёменко Дарья Владимировна" | "Ведерникова Людмила Эдуардовна"

export interface ILecture {
  name : "Физра" | "СиС" | "Англ яз" | "КПиЯП"| "Физика"| "История"| "РиСБД"
  timeDuration : "8:00-9:40" | "9:55-11:35" | "12:15-13:55" | "14:10-15:50" | "16:20-18:00" | "18:15-19:55" 
  teachers : ITeacher[]
  audition : "213" | "216"| "219" | "314" | "310" | "323" | "Спортзал" | "309" 
  type: 'lecture'
}


interface ILunch{
  timeDuration : '11:35-12:15' | '15:50-16:20'
  type:  'lunch' 
  name: 'Обед'
}

export type IDayEvent = ILecture | ILunch

export interface IDay {
  name : 'Понедельник' | 'Вторник' | 'Среда' | 'Четверг' | 'Пятница' | 'Суббота'
  duration?: string
  events : IDayEvent[]
}
