export interface ILecture {
  name : "Физра" | "СиС" | "Англ яз" | "КПиЯП"| "Физика"| "История"| "РиСБД"
  timeDuration : "8:00-9:40" | "9:55-11:35" | "12:15-13:55" | "14:10-15:50" | "16:20-18:00" | "18:15-19:55" 
  teacher : "Прохорчук А.В." | "Мороз Л.М." | "Ханько А.В." | "Янович Н.И.-Марков В.И." | "Кривицкий С.В.-Праволоцкий А.Н." | "Ерёменко Д.В." | "Ведерникова Л.Э."
  teacherIF : "Анна Владимировна" | "Лариса Михайловна" | "Андрей Викторович" | "Надежда Ивановна-Владислав Игоревич" | "Сергей Валентинович-Алексей Николаевич" | "Дарья Владимировна" | "Людмила Эдуардовна"
  audition : "213" | "216"| "219" | "314" | "310" | "323" | "Спортзал" | "309" 
  type: 'lecture'
}

// need refactoring about teacher names 


interface ILunch{
  timeDuration : '11:35-12:15' | '15:50-16:20'
  type:  'lunch' 
  name: 'Обед'
}

export type IDayEvent = ILecture | ILunch

export interface IDay {
  name : 'Понедельник' | 'Вторник' | 'Среда' | 'Четверг' | 'Пятница' | 'Суббота'
  duration?: string
  events : IDayEvent[]
}
